Importing Pandas and Numpy.

In [ ]:
import pandas as pd
import numpy as np

Importing csv file and creatinf DataFrame df.

In [ ]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Checking the shape of DataFrame.

In [ ]:
df.shape

(891, 12)

Checking the empty columns of DataFrame.

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Make DataFrame more workable by dropping null columns.

In [ ]:
drop_col = df.isnull().sum()[df.isnull().sum()>(35/100*df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df.drop(drop_col.index, axis = 1, inplace = True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
df.fillna(df.mean(), inplace = True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

Filling empty spaces of Embakred by substituing empty values with 'S' as 'S' had the maximum occurance.

In [ ]:
df['Embarked'].fillna('S', inplace = True)

In [ ]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

Establishing Correlation between various columns to analyse the data.

In [ ]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

Creating a new column by combining the data from 'SibSp' and 'Parch' and then dropping both the columns to avoid redundancy.

In [ ]:
df['FamilySize'] = df['SibSp'] + df['Parch']
df.drop(['SibSp','Parch'], axis = 1, inplace = True)
df.corr

<bound method DataFrame.corr of      PassengerId  Survived  Pclass  ... Cabin Embarked  FamilySize
0              1         0       3  ...   NaN        S           1
1              2         1       1  ...   C85        C           1
2              3         1       3  ...   NaN        S           0
3              4         1       1  ...  C123        S           1
4              5         0       3  ...   NaN        S           0
..           ...       ...     ...  ...   ...      ...         ...
886          887         0       2  ...   NaN        S           0
887          888         1       1  ...   B42        S           0
888          889         0       3  ...   NaN        S           3
889          890         1       1  ...  C148        C           0
890          891         0       3  ...   NaN        Q           0

[891 rows x 11 columns]>

In [ ]:
df['Alone'] = [0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 12 columns]

In [ ]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [ ]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

In [ ]:
df['Sex'] = [0 if df['Sex'][i] == 'male' else 1 for i in df.index]
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [ ]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

In [ ]:
df.groupby(['Pclass'])['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

Conclusions:
1.   Chances of survival of passengers travelling with family was higher than those travelling alone.
2.   Chances of survival of female passengers were higher than male passengers.
3.   Chanes of survival of passangers boarding from Cherbourgh was higher than those boarding from Queenstone and Southampton.
4.   Chances of survival of passangers travelling in 1st Class were higher than those boarding 2nd and 3rd class.